# -*- coding: utf-8 -*-

Token = "Your-Token"

sudohelp = '''💫 راهنمای اسپید استار مخصوص سودو ها.

⚡️روشن
#روشن کردن ربات در گروه.

⚡️خاموش
#خاموش کردن ربات در گروه.

⚡️ریلود
#اعمال تغییرات در ربات

⚡️اطلاعات
#دریافت اطلاعات ربات

⚡️فوروارد [ریپلی روی متن]
#فوروارر متن به تمامی گروه ها.

⚡️شارژ [تعداد روز]
#شارژ کردن یک گروه.

⚡️کسر شارژ [تعداد روز]
#کم کردن شارژ گروه.

⚡️خروج 
#خارج کردن ربات از گروه.'''

helpgp = '''راهنمای اسپید استار ✨
⚡️ این دستورات مخصوص مدیران گروه است :

⚡️تنظیمات
#دریافت پنل قفل های گروه.

⚡️بستن گروه / بازکردن گروه
#بستن و به کردن گروه[بستن چت].

⚡️بیصدا 
#بیصدا کاربر با ریپلی روی یکی از پیغام هایش .

⚡️باصدا
#باصدا کردن با ریپلی روی یکی از پیغام هایش.

⚡️لیست سکوت
#دریافت لیست افراد ساکت شده.

⚡️اخطار [+|-] (ریپلی روی یکی از پیغام های کاربر)
#اخطار دادن به کاربر. حدااکثر اخطار ۴،پس از رسیدن اخطار ها به ۴ کاربر ‌اخراج میشود .

⚡️حذف [۱-۵۰۰]
#حذف پیام های گروه با تعداد دلخواه.

⚡️تنظیم اسپم [عدد]
#تنظیم تعداد اسپم (محدودیت تعداد ارسال پیام).

⚡️تنظیم زمان [عدد]
#تنظیم زمان ارسال پیام مکرر.

⚡️فیلتر [کلمه]
#ممنوع کردن ارسال یک کلمه.

⚡️ازاد [کلمه]
#ازاد کردن ارسال یک کلمه.

⚡️لیست فیلتر
#دریافت لیست کلمات ممنوع شده.

⚡️ترفیع
#ناظم کردن یک کاربر توسط ریپلی روی یکی از پیغام های کاربر.

⚡️تنزل
#برکناری از ناظمیت یک کاربر توسط ریپلی روی یکی از پیغام های کاربر.

⚡️تنظیم لینک [لینک گروه]
⚡️تنظیم قوانین [قوانین گروه]
⚡️تنظیم نام [نام گروه]
⚡️تنظیم عکس [تنظیم عکس گروه با ریپلی روی عکس]
⚡️تنظیم سنجاق [سنجاق کردن یک پیام با ریپلی روی پیام]
⚡️تنظیم کاراکتر [تعداد کاراکتر]
#تنظیم تعداد حروف در جمله.

⚡️قوانین
#دریافت قوانین گروه.

⚡️لینک
#دریافت لینک گروه.

⚡️اخراج 
#اخراج یک کاربر با ریپلی روی یکی از پیغام های کاربر.

🤹‍♂ راهنمای سرگرمی:

🎲 اذان [شهر موردنظر]
#دریافت اوقات شرعی شهر انتخابی.

🎲 عکس [ریپلی روی استیکر]
#تبدیل استیکر به عکس.

🎲 استیکر [ریپلی روی عکس]
#تبدیل عکس به استیکر.'''

starttext = '''
💫 به ربات "آنتی اسپم Speed Star🌟 " خوش امدید ✨
⚜️ ساخته شده با ❤️ فقط برای شما ☺️
Git : https://github.com/Star-Speed/Speed-Star
@Speed_Star'''

about = '''Speed Star Bot .
Version : 1.2
Channel : @Speed_Star
Bot : @SpeedStarBot
Github : https://github.com/Star-Speed/Speed-Star
'''
sup = 'GP Support'
sudos = [0000000]
